ruipu/backend/controllers/AboutController.php

SELECT * FROM `agency` LIMIT 2 OFFSET 2
SELECT COUNT(*) FROM `agency`
---
	public function actionAgency(){

		$model_agency = new Agency();
		$data = $model_agency ->selectall();
        $data = Agency::find();
        $pages = new Pagination(['totalCount' =>$data->count(), 'pageSize' => '2']);
        $model = $data->offset($pages->offset)->limit($pages->limit)->all();