ruipu/backend/models/User.php

    public function signin(){
        $uname = htmlspecialchars(Yii::$app->request->post('u_name'));
        $passwd = htmlspecialchars(md5((Yii::$app->request->post('passwd'))));
        if(strpos($uname,'@')){
            return $this->find()->asArray()
                ->select('*')
                //->join('INNER JOIN','user_role','user.u_id = user_role.u_id')
                //->join('INNER JOIN','role','user_role.r_id = role.r_id')
                ->where(['u_name'=>$uname,'u_pwd'=>$passwd])->one();
        }else{
            return $this->find()->asArray()
                ->select('*')
---
SELECT * FROM `user` WHERE (`u_name`='帅到被砍') AND (`u_pwd`='4547e2781bd1d816166766fda702c7d9')