ruipu/frontend/models/Order.php

    public function selectall(){

        return $this->find()->asArray()->all();
---
SELECT * FROM `order`