ruipu/frontend/models/Receipt.php

     public function get_address(){
      $user_name =  Yii::$app->session->get('uname');
      $arr =(new \yii\db\Query())
             ->select('u_id')
             ->from('user as u')
             ->where("u.u_name = '$user_name'")
             ->one();
      $u_id=$arr['u_id'];
      return $this->find()->where("u_id = $u_id")->orderBy(['is_moren'=>SORT_DESC])->asArray()->all();
---
SELECT `u_id` FROM `user` `u` WHERE u.u_name = '张晨阳'
SELECT * FROM `receipt` WHERE u_id = 2 ORDER BY `is_moren` DESC