ruipu/frontend/models/Region.php

    public function addr_ajax(){
      $p_name = $_GET['v'];
      $arr1 = $this->find()->where("region_name='$p_name'")->asArray()->one();
      $p_id = $arr1['region_id'];
      $arr = $this->find()->where("parent_id = $p_id")->asArray()->all();
---
SELECT * FROM `region` WHERE region_name='龙岩'
SELECT * FROM `region` WHERE parent_id = 54