ruipu/frontend/models/User.php

      public function pwd_update(){
          $old_pwd = $_GET['old_pwd'];
          $new_pwd = $_GET['new_pwd'];
          $user_name = '张晨阳';
          $arr = $this->find()->where("u_name = '$user_name'")->asArray()->one();
---
SELECT * FROM `user` `u` WHERE u.u_name = '张晨阳'