ruipu/frontend/models/User.php

SELECT * FROM `user` `u` INNER JOIN `exercise` `ex` ON u.u_id=ex.u_id INNER JOIN `doctor` `doc` ON ex.d_id=doc.doc_id WHERE u.u_name = 'zcy'
---
    public  function  user_center(){
       $user_name = '张晨阳';
        $db = Yii::$app->db;
        //$arr = $db->createCommand("select * from user where u_name = '$user_name'")->queryAll();
      $arr =(new \yii\db\Query())
              ->select('*')
              ->from('user as u')
              ->innerJoin("exercise as ex","u.u_id=ex.u_id")
              ->innerJoin("doctor as doc","ex.d_id=doc.doc_id")
              ->where("u.u_name = '$user_name'")
              ->one();